In [1]:
import pandas as pd

In [2]:
# read the checkin dataset
fn = 'yelp_academic_dataset_checkin.json'

In [3]:
df_checkin = pd.read_json(fn, lines=True)

In [5]:
df_checkin.head()

              business_id                                               date
0  --0r8K_AQ4FZfLsX3ZYRDA                                2017-09-03 17:13:59
1  --0zrn43LEaB4jUWTQH_Bg  2010-10-08 22:21:20, 2010-11-01 21:29:14, 2010...
2  --164t1nclzzmca7eDiJMw  2010-02-26 02:06:53, 2010-02-27 08:00:09, 2010...
3  --2aF9NhXnNVpDV0KS3xBQ  2014-11-03 16:35:35, 2015-01-30 18:16:03, 2015...
4  --2mEJ63SC_8_08_jGgVIg  2010-12-15 17:10:46, 2013-12-28 00:27:54, 2015...

In [8]:
# split data column and count the times of check in for each business_id
df_checkin['date_list'] = df_checkin['date'].str.split(',')

In [9]:
df_checkin['count'] = df_checkin['date_list'].apply(len)

In [10]:
df_checkin.head()

,business_id,date,count,date_list
0,--0r8K_AQ4FZfLsX3ZYRDA,2017-09-03 17:13:59,1,[2017-09-03 17:13:59]
1,--0zrn43LEaB4jUWTQH_Bg,"2010-10-08 22:21:20, 2010-11-01 21:29:14, 2010...",9,"[2010-10-08 22:21:20, 2010-11-01 21:29:14, 2..."
2,--164t1nclzzmca7eDiJMw,"2010-02-26 02:06:53, 2010-02-27 08:00:09, 2010...",311,"[2010-02-26 02:06:53, 2010-02-27 08:00:09, 2..."
3,--2aF9NhXnNVpDV0KS3xBQ,"2014-11-03 16:35:35, 2015-01-30 18:16:03, 2015...",8,"[2014-11-03 16:35:35, 2015-01-30 18:16:03, 2..."
4,--2mEJ63SC_8_08_jGgVIg,"2010-12-15 17:10:46, 2013-12-28 00:27:54, 2015...",4,"[2010-12-15 17:10:46, 2013-12-28 00:27:54, 2..."

In [12]:
df_checkin[['count']].describe()

               count
count  138876.000000
mean      134.229759
std       669.356700
min         1.000000
25%         6.000000
50%        24.000000
75%        93.000000
max    150005.000000

In [13]:
df_out = df_checkin[['business_id', 'count']]

## Only keep MA business

In [15]:
#read the business dataset
df_bus = pd.read_json('yelp_academic_dataset_business.json', lines=True)

In [17]:
df_bus.head(3)

,business_id,name,address,city,state,postal_code,latitude,longitude,stars,review_count,is_open,attributes,categories,hours
0,6iYb2HFDywm3zjuRg0shjw,Oskar Blues Taproom,921 Pearl St,Boulder,CO,80302,40.017544,-105.283348,4.0,86,1,"{'RestaurantsTableService': 'True', 'WiFi': 'u...","Gastropubs, Food, Beer Gardens, Restaurants, B...","{'Monday': '11:0-23:0', 'Tuesday': '11:0-23:0'..."
1,tCbdrRPZA0oiIYSmHG3J0w,Flying Elephants at PDX,7000 NE Airport Way,Portland,OR,97218,45.588906,-122.593331,4.0,126,1,"{'RestaurantsTakeOut': 'True', 'RestaurantsAtt...","Salad, Soup, Sandwiches, Delis, Restaurants, C...","{'Monday': '5:0-18:0', 'Tuesday': '5:0-17:0', ..."
2,bvN78flM8NLprQ1a1y5dRg,The Reclaimory,4720 Hawthorne Ave,Portland,OR,97214,45.511907,-122.613693,4.5,13,1,"{'BusinessAcceptsCreditCards': 'True', 'Restau...","Antiques, Fashion, Used, Vintage & Consignment...","{'Thursday': '11:0-18:0', 'Friday': '11:0-18:0..."

In [20]:
#select business_id which state is in MA
ma_business_list = df_bus[df_bus['state']=='MA']['business_id'].tolist()

In [22]:
len(ma_business_list)

36012

In [24]:
#select checkin count which business_id is in MA
df_out_ma = df_out[df_out['business_id'].isin(ma_business_list)]

In [26]:
df_out_ma.reset_index(drop=True, inplace=True)

In [27]:
df_out_ma

                  business_id  count
0      --DzGwfuJH12DjYz95VW0Q      2
1      --JuLhLvq3gyjNnXT9Q95w      1
2      --fFGOHU7mjZ670MkFJeFA     18
3      --hkbIWgBKBOZq4VcNwdhQ   1204
4      --iiZK8pW7kC2Tr2PdQrQw     43
...                       ...    ...
29393  zzW7_Vlp9LwfNhpdxT1umw      1
29394  zzYJ9sVxW7WtyzjIw4Kxdw      1
29395  zzapa0IpbAUV-Fk7vxxmjA      1
29396  zzcdycb7S42VnnZkwE4yNA     28
29397  zzngBb9MoGpkFe8tfowvvA    127

[29398 rows x 2 columns]

In [29]:
#output the dataset as .csv
out_fn = 'checkin_count_ma.csv'

In [30]:
df_out_ma.to_csv(out_fn, index=False)